3semesterProjekt-Git/3semesterProjekt_repository/PSoC kode/NeoPixel/NeoPixel.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Data_aliases.h"
#include "Data.h"
#include "Clock_1.h"
#include "NP_funcs.h"
#include "trigger_aliases.h"
#include "trigger.h"
#include "echo_2_aliases.h"
#include "echo_2.h"
#include "pulseInt.h"
#include "pulseCounter.h"
#include "echo_1_aliases.h"
#include "echo_1.h"
#include "echo_3_aliases.h"
#include "echo_3.h"
#include "echo_4_aliases.h"
#include "echo_4.h"
#include "echoInt_1.h"
#include "echoInt_2.h"
#include "echoInt_3.h"
#include "echoInt_4.h"
#include "CLK_500kHz.h"
#include "triggerPWM.h"
#include "CLK_24MHz.h"
#include "LED_aliases.h"
#include "LED.h"
#include "Pin1_dir2_aliases.h"
#include "Pin1_dir2.h"
#include "Pin1_dir1_aliases.h"
#include "Pin1_dir1.h"
#include "Pin2_dir1_aliases.h"
#include "Pin2_dir1.h"
#include "Pin2_dir2_aliases.h"
#include "Pin2_dir2.h"
#include "motorPWM_1.h"
#include "clock_motor.h"
#include "Pin_pwm1_aliases.h"
#include "Pin_pwm1.h"
#include "ball_int.h"
#include "ballsig_aliases.h"
#include "ballsig.h"
#include "isr_rpi_start.h"
#include "Pin_rpi_start_stop_aliases.h"
#include "Pin_rpi_start_stop.h"
#include "Pin_score_aliases.h"
#include "Pin_score.h"
#include "isr_rpi_stop.h"
#include "ADC_SAR_1.h"
#include "Scale_input_aliases.h"
#include "Scale_input.h"
#include "motorPWM_2.h"
#include "Pin_pwm2_aliases.h"
#include "Pin_pwm2.h"
#include "soundUART.h"
#include "NP_Neo_BITCNT.h"
#include "NP_Neo_ONTime.h"
#include "NP_Neo_OFFTime.h"
#include "NP_Neo_defs.h"
#include "NP_DMA_dma.h"
#include "ADC_SAR_1_IRQ.h"
#include "ADC_SAR_1_theACLK.h"
#include "soundUART_IntClock.h"
#include "core_cm3_psoc5.h"
#include "core_cm3.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "core_cmFunc.h"
#include "core_cmInstr.h"
#include "cy_em_eeprom.h"

/*[]*/

